IDENTIFICATION DIVISION.
PROGRAM-ID. reeeeeeee.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  RANT-OVER   PIC 9 VALUE 0.

PROCEDURE DIVISION.
Main.
    PERFORM Begin-Rant.
    PERFORM Rant UNTIL RANT-OVER = 1.
    STOP RUN.

Begin-Rant.
    DISPLAY "r" WITH NO ADVANCING.
    
Rant.
    DISPLAY "e" WITH NO ADVANCING.
